In [30]:
import pandas as pd # Importing a module / "dependency" 
import numpy as np
import matplotlib as plt
import math

In [5]:
titanic_df = pd.read_csv("titanic_test_data.csv")

In [11]:
titanic_df.describe()
# The mean age is 30 years, with a max of 76 y/o and a min of 0.17 y/o?
# The num parent / child is funky... no 25/50/75%
# The fare price is skewed right... mean of 35 greater than 3rd quartile.

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [12]:
titanic_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [9]:
titanic_df["Embarked"].value_counts()

Embarked
S    270
C    102
Q     46
Name: count, dtype: int64

In [17]:
titanic_df["embarked_new"]=np.where(titanic_df["Embarked"] == "C", "Cherbourg", # If in embarked and "C", rename "Cherbourg"
                                      np.where("Embarked") == "Q", "Queenstown", # ..for Queenstown
                                      "Southampton") # Else, Southampton

/var/folders/jq/xzwg3k5d0nqb3574ynkvzc740000gn/T/ipykernel_50572/874851682.py:2: DeprecationWarning: Calling nonzero on 0d arrays is deprecated, as it behaves surprisingly. Use `atleast_1d(arr).nonzero()` if the old behavior was intended.
  np.where("Embarked") == "Q", "Queenstown", # ..for Queenstown

TypeError: where() takes from 1 to 3 positional arguments but 5 were given

In [22]:
titanic_df["mr_mrs"] = np.where(titanic_df["Name"].str.contains("Mrs."), "Mrs",
                                np.where(titanic_df["Name"].str.contains("Ms."), "Ms.", "Mr."))

# It might not be accurate to assume everyone without Mrs/Ms in their names are a "Mister"

In [21]:
titanic_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,mr_mrs
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,Mr.
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,Mrs
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,Mr.
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,Mr.
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,Mrs

# Basic Plots:

In [26]:
# Always (x-axis, y-axis)
plt.plot(titanic_df['Age'], titanic_df['Fare'], '.')

AttributeError: module 'matplotlib' has no attribute 'plot'

# Histograms:

In [29]:
# Shows how many things are in a range:
plt.hist(titanic_df['Embarked'])

AttributeError: module 'matplotlib' has no attribute 'hist'

In [33]:
plt.figure(figsize = [5, 5])
plt.hist(titanic_df['Embarked'])
plt.xlabel('Port of Embarcation')
plt.ylabel('Count of People')
plt.title("Port of Embarcation Numbers")
plt.xticks(fontsize = 20)
plt.yticks(fontsize = 20)
plt.grid(titanic_df)

AttributeError: module 'matplotlib' has no attribute 'figure'

# Pie Charts:

In [35]:
agg_gender = titanic_df.groupby('Sex').count()
agg_gender

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,mr_mrs
Sex,,,,,,,,,,,
female,152,152,152,127,152,152,152,152,44,152,152
male,266,266,266,205,266,266,266,265,47,266,266

In [39]:
colors = ['pink', 'blue']
agg_gender.plot(kind = 'pie', y = 'PassengerID', colors = colors)

KeyError: 'PassengerID'